In [5]:
import pandas as pd
scientists = pd.read_csv('scientists.csv')

In [6]:
ages = scientists['Age']
print(ages)

0     66
1     37
2     41
3     86
4     86
      ..
95    72
96    58
97    76
98    41
99    76
Name: Age, Length: 100, dtype: int64

In [7]:
print(ages + pd.Series([1, 100]))

0      67.0
1     137.0
2       NaN
3       NaN
4       NaN
      ...
95      NaN
96      NaN
97      NaN
98      NaN
99      NaN
Length: 100, dtype: float64

In [8]:
scientists.index

RangeIndex(start=0, stop=100, step=1)

In [9]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [10]:
scientists.values

array([['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rosalind Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Albert Einstein', '1879-03-14', '1955-04-18', 76, 'Physicist'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Lise Meitner', '1878-11-07', '1968-10-27', 89, 'Physicist'],
       ['Gregor Mendel', '1822-07-20', '1884-01-06', 61, 'Geneticist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Rosalind Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Erwin Schrödinger', '1887-08-12', '1961-01-04', 73, 'Physicist'],
       ['Barbara McClintock', '1902-06-16', '1992-09-02', 90,
        'Geneticist'],
       ['Rosalind Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Gregor Mendel', '1822-07-20', '1884-01-06', 61, 'Geneticist'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Johannes Kepler', '1571-12-27', '1630-11-15', 58, 'Astronomer'],
       ['Lise Meitner', '1878-11-07', '1968-10-27', 89, 'Physicist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Rosalind Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['Isaac Newton', '1643-01-04', '1727-03-31', 84, 'Physicist'],
       ['Gregor Mendel', '1822-07-20', '1884-01-06', 61, 'Geneticist'],
       ['Michael Faraday', '1791-09-22', '1867-08-25', 75, 'Physicist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Albert Einstein', '1879-03-14', '1955-04-18', 76, 'Physicist'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Michael Faraday', '1791-09-22', '1867-08-25', 75, 'Physicist'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['Barbara McClintock', '1902-06-16', '1992-09-02', 90,
        'Geneticist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Johannes Kepler', '1571-12-27', '1630-11-15', 58, 'Astronomer'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Galileo Galilei', '1564-02-15', '1642-01-08', 77, 'Astronomer'],
       ['Barbara McClintock', '1902-06-16', '1992-09-02', 90,
        'Geneticist'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['Lise Meitner', '1878-11-07', '1968-10-27', 89, 'Physicist'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Galileo Galilei', '1564-02-15', '1642-01-08', 77, 'Astronomer'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Johannes Kepler', '1571-12-27', '1630-11-15', 58, 'Astronomer'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['Isaac Newton', '1643-01-04', '1727-03-31', 84, 'Physicist'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['James Clerk Maxwell', '1831-06-13', '1879-11-05', 48,
        'Physicist'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Barbara McClintock', '1902-06-16', '1992-09-02', 90,
        'Geneticist'],
       ['Isaac Newton', '1643-01-04', '1727-03-31', 84, 'Physicist'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Isaac Newton', '1643-01-04', '1727-03-31', 84, 'Physicist'],
       ['Johannes Kepler', '1571-12-27', '1630-11-15', 58, 'Astronomer'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Max Planck', '1858-04-23', '1947-10-04', 89, 'Physicist'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['Michael Faraday', '1791-09-22', '1867-08-25', 75, 'Physicist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Nikola Tesla', '1856-07-10', '1943-01-07', 86, 'Engineer'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Michael Faraday', '1791-09-22', '1867-08-25', 75, 'Physicist'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Lise Meitner', '1878-11-07', '1968-10-27', 89, 'Physicist'],
       ['Michael Faraday', '1791-09-22', '1867-08-25', 75, 'Physicist'],
       ['Charles Darwin', '1809-02-12', '1882-04-19', 73, 'Biologist'],
       ['Richard Feynman', '1918-05-11', '1988-02-15', 69, 'Physicist'],
       ['Dmitri Mendeleev', '1834-02-08', '1907-02-02', 72, 'Chemist'],
       ['Johannes Kepler', '1571-12-27', '1630-11-15', 58, 'Astronomer'],
       ['Albert Einstein', '1879-03-14', '1955-04-18', 76, 'Physicist'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41, 'Mathematician'],
       ['Albert Einstein', '1879-03-14', '1955-04-18', 76, 'Physicist']],
      dtype=object)

In [11]:
# boolean vectors will subset rows
print(scientists.loc[scientists['Age'] > scientists['Age'].mean()])

                    Name        Born        Died  Age Occupation
3           Nikola Tesla  1856-07-10  1943-01-07   86   Engineer
4           Nikola Tesla  1856-07-10  1943-01-07   86   Engineer
5        Albert Einstein  1879-03-14  1955-04-18   76  Physicist
7             Max Planck  1858-04-23  1947-10-04   89  Physicist
8   Florence Nightingale  1820-05-12  1910-08-13   90      Nurse
..                   ...         ...         ...  ...        ...
92       Michael Faraday  1791-09-22  1867-08-25   75  Physicist
93        Charles Darwin  1809-02-12  1882-04-19   73  Biologist
95      Dmitri Mendeleev  1834-02-08  1907-02-02   72    Chemist
97       Albert Einstein  1879-03-14  1955-04-18   76  Physicist
99       Albert Einstein  1879-03-14  1955-04-18   76  Physicist

[61 rows x 5 columns]

In [12]:
first_half = scientists[:4]
second_half = scientists[4:]
print(first_half)

                Name        Born        Died  Age     Occupation
0        Marie Curie  1867-11-07  1934-07-04   66        Chemist
1  Rosalind Franklin  1920-07-25  1958-04-16   37        Chemist
2        Alan Turing  1912-06-23  1954-06-07   41  Mathematician
3       Nikola Tesla  1856-07-10  1943-01-07   86       Engineer

In [13]:
print(second_half)

                    Name        Born        Died  Age     Occupation
4           Nikola Tesla  1856-07-10  1943-01-07   86       Engineer
5        Albert Einstein  1879-03-14  1955-04-18   76      Physicist
6            Marie Curie  1867-11-07  1934-07-04   66        Chemist
7             Max Planck  1858-04-23  1947-10-04   89      Physicist
8   Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
..                   ...         ...         ...  ...            ...
95      Dmitri Mendeleev  1834-02-08  1907-02-02   72        Chemist
96       Johannes Kepler  1571-12-27  1630-11-15   58     Astronomer
97       Albert Einstein  1879-03-14  1955-04-18   76      Physicist
98           Alan Turing  1912-06-23  1954-06-07   41  Mathematician
99       Albert Einstein  1879-03-14  1955-04-18   76      Physicist

[96 rows x 5 columns]

In [14]:
# multiply by a scalar
print(scientists * 2)

                                  Name                  Born  \
0               Marie CurieMarie Curie  1867-11-071867-11-07
1   Rosalind FranklinRosalind Franklin  1920-07-251920-07-25
2               Alan TuringAlan Turing  1912-06-231912-06-23
3             Nikola TeslaNikola Tesla  1856-07-101856-07-10
4             Nikola TeslaNikola Tesla  1856-07-101856-07-10
..                                 ...                   ...
95    Dmitri MendeleevDmitri Mendeleev  1834-02-081834-02-08
96      Johannes KeplerJohannes Kepler  1571-12-271571-12-27
97      Albert EinsteinAlbert Einstein  1879-03-141879-03-14
98              Alan TuringAlan Turing  1912-06-231912-06-23
99      Albert EinsteinAlbert Einstein  1879-03-141879-03-14

                    Died  Age                  Occupation
0   1934-07-041934-07-04  132              ChemistChemist
1   1958-04-161958-04-16   74              ChemistChemist
2   1954-06-071954-06-07   82  MathematicianMathematician
3   1943-01-071943-01-07  172            EngineerEngineer
4   1943-01-071943-01-07  172            EngineerEngineer
..                   ...  ...                         ...
95  1907-02-021907-02-02  144              ChemistChemist
96  1630-11-151630-11-15  116        AstronomerAstronomer
97  1955-04-181955-04-18  152          PhysicistPhysicist
98  1954-06-071954-06-07   82  MathematicianMathematician
99  1955-04-181955-04-18  152          PhysicistPhysicist

[100 rows x 5 columns]

In [15]:
print(scientists.dtypes)

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [28]:
# format the 'Born' column as a datetime
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d', errors='coerce')
born_datetime

0    1867-11-07
1    1920-07-25
2    1912-06-23
3    1856-07-10
4    1856-07-10
        ...
95   1834-02-08
96          NaT
97   1879-03-14
98   1912-06-23
99   1879-03-14
Name: Born, Length: 100, dtype: datetime64[ns]

In [36]:
# format the 'Died' column as a datetime
died_datetime = pd.to_datetime(scientists['Died'], format ='%Y-%m-%d',errors='coerce')
died_datetime

0    1934-07-04
1    1958-04-16
2    1954-06-07
3    1943-01-07
4    1943-01-07
        ...
95   1907-02-02
96          NaT
97   1955-04-18
98   1954-06-07
99   1955-04-18
Name: Died, Length: 100, dtype: datetime64[ns]

In [37]:
scientists['born_dt'], scientists['died_dt'] = (
  born_datetime,
  died_datetime
)

print(scientists.head())

                Name        Born        Died  Age     Occupation    born_dt  \
0        Marie Curie  1867-11-07  1934-07-04   66        Chemist 1867-11-07
1  Rosalind Franklin  1920-07-25  1958-04-16   37        Chemist 1920-07-25
2        Alan Turing  1912-06-23  1954-06-07   41  Mathematician 1912-06-23
3       Nikola Tesla  1856-07-10  1943-01-07   86       Engineer 1856-07-10
4       Nikola Tesla  1856-07-10  1943-01-07   86       Engineer 1856-07-10

     died_dt
0 1934-07-04
1 1958-04-16
2 1954-06-07
3 1943-01-07
4 1943-01-07

In [38]:
print(scientists.shape)

(100, 7)

In [39]:
print(scientists.dtypes)

Name                  object
Born                  object
Died                  object
Age                    int64
Occupation            object
born_dt       datetime64[ns]
died_dt       datetime64[ns]
dtype: object

In [40]:
print(scientists['Age'])

0     66
1     37
2     41
3     86
4     86
      ..
95    72
96    58
97    76
98    41
99    76
Name: Age, Length: 100, dtype: int64

In [41]:
# the frac=1 tells pandas to randomly select 100% of the values
# the random_state makes the randomization the same each time
scientists["Age"] = scientists["Age"].sample(frac =1, random_state =42)

In [42]:
# the previous line of code is equivalent to
scientists['Age'] = (
  scientists['Age']
  .sample(frac=1, random_state =42)
)
print(scientists['Age'])

0     66
1     37
2     41
3     86
4     86
      ..
95    72
96    58
97    76
98    41
99    76
Name: Age, Length: 100, dtype: int64

In [44]:
# subtracting dates will give us number of days
scientists['age_days'] = (
  scientists['died_dt'] - scientists['born_dt']
)

scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days
0,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
1,Rosalind Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
2,Alan Turing,1912-06-23,1954-06-07,41,Mathematician,1912-06-23,1954-06-07,15324 days
3,Nikola Tesla,1856-07-10,1943-01-07,86,Engineer,1856-07-10,1943-01-07,31591 days
4,Nikola Tesla,1856-07-10,1943-01-07,86,Engineer,1856-07-10,1943-01-07,31591 days
...,...,...,...,...,...,...,...,...
95,Dmitri Mendeleev,1834-02-08,1907-02-02,72,Chemist,1834-02-08,1907-02-02,26656 days
96,Johannes Kepler,1571-12-27,1630-11-15,58,Astronomer,NaT,NaT,NaT
97,Albert Einstein,1879-03-14,1955-04-18,76,Physicist,1879-03-14,1955-04-18,27793 days
98,Alan Turing,1912-06-23,1954-06-07,41,Mathematician,1912-06-23,1954-06-07,15324 days
99,Albert Einstein,1879-03-14,1955-04-18,76,Physicist,1879-03-14,1955-04-18,27793 days

In [48]:
# we can convert the value to just the year
# using the astype method
scientists['age_years'] = (
    scientists['age_days'] / pd.Timedelta(days=365.25)
).round().astype('Int64')  # Nullable integer type


scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days,age_years
0,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days,67
1,Rosalind Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days,38
2,Alan Turing,1912-06-23,1954-06-07,41,Mathematician,1912-06-23,1954-06-07,15324 days,42
3,Nikola Tesla,1856-07-10,1943-01-07,86,Engineer,1856-07-10,1943-01-07,31591 days,86
4,Nikola Tesla,1856-07-10,1943-01-07,86,Engineer,1856-07-10,1943-01-07,31591 days,86
...,...,...,...,...,...,...,...,...,...
95,Dmitri Mendeleev,1834-02-08,1907-02-02,72,Chemist,1834-02-08,1907-02-02,26656 days,73
96,Johannes Kepler,1571-12-27,1630-11-15,58,Astronomer,NaT,NaT,NaT,<NA>
97,Albert Einstein,1879-03-14,1955-04-18,76,Physicist,1879-03-14,1955-04-18,27793 days,76
98,Alan Turing,1912-06-23,1954-06-07,41,Mathematician,1912-06-23,1954-06-07,15324 days,42
99,Albert Einstein,1879-03-14,1955-04-18,76,Physicist,1879-03-14,1955-04-18,27793 days,76

In [ ]:
scientists = scientists.assign(
  # new columns on the left of the equal sign
  # how to calculate values on the right of the equal sign
  # separate new columns with a comma
  age_days_assign=scientists['died_dt'] - scientists['born_dt'],
  age_year_assign=scientists['age_days'].astype('timedelta64[Y]')
)

In [49]:
# drop the shuffled age column
# you provide the axis=1 argument to drop column-wise
scientists_dropped = scientists.drop(['Age'], axis ="columns")
# columns after dropping our column
print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt', 'age_days',
       'age_years'],
      dtype='object')